In [112]:
import pandas as pd

In [113]:
df = pd.read_csv('titanic.csv')

In [114]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [115]:
act_df = df.drop(['PassengerId', 'Name', 'SibSp', 'Parch', 'Ticket', 'Cabin', 'Embarked'], axis = 'columns')

In [116]:
act_df

     Survived  Pclass     Sex   Age     Fare
0           0       3    male  22.0   7.2500
1           1       1  female  38.0  71.2833
2           1       3  female  26.0   7.9250
3           1       1  female  35.0  53.1000
4           0       3    male  35.0   8.0500
..        ...     ...     ...   ...      ...
886         0       2    male  27.0  13.0000
887         1       1  female  19.0  30.0000
888         0       3  female   NaN  23.4500
889         1       1    male  26.0  30.0000
890         0       3    male  32.0   7.7500

[891 rows x 5 columns]

In [117]:
import math
age_mean = math.floor(act_df.Age.mean())
age_mean

29

In [118]:
act_df = act_df.fillna(age_mean)

In [119]:
act_df

     Survived  Pclass     Sex   Age     Fare
0           0       3    male  22.0   7.2500
1           1       1  female  38.0  71.2833
2           1       3  female  26.0   7.9250
3           1       1  female  35.0  53.1000
4           0       3    male  35.0   8.0500
..        ...     ...     ...   ...      ...
886         0       2    male  27.0  13.0000
887         1       1  female  19.0  30.0000
888         0       3  female  29.0  23.4500
889         1       1    male  26.0  30.0000
890         0       3    male  32.0   7.7500

[891 rows x 5 columns]

In [120]:
inputs = act_df.drop(['Survived'], axis = 'columns')
inputs.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [121]:
target = act_df['Survived']

In [122]:
target.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [123]:
from sklearn.preprocessing import LabelEncoder
le_gender = LabelEncoder()

In [124]:
inputs['Gender_n'] = le_gender.fit_transform(inputs['Sex'])

In [125]:
inputs.head()

   Pclass     Sex   Age     Fare  Gender_n
0       3    male  22.0   7.2500         1
1       1  female  38.0  71.2833         0
2       3  female  26.0   7.9250         0
3       1  female  35.0  53.1000         0
4       3    male  35.0   8.0500         1

In [126]:
inputs_n = inputs.drop(['Sex'], axis = 'columns')

In [127]:
inputs_n.head()

   Pclass   Age     Fare  Gender_n
0       3  22.0   7.2500         1
1       1  38.0  71.2833         0
2       3  26.0   7.9250         0
3       1  35.0  53.1000         0
4       3  35.0   8.0500         1

In [128]:
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test = train_test_split(inputs_n, target, train_size = 0.8)

In [129]:
from sklearn import tree

In [130]:
model = tree.DecisionTreeClassifier()

In [131]:
model.fit(x_train, y_train)

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=None,
                       max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort=False,
                       random_state=None, splitter='best')

In [132]:
model.score(x_test, y_test)

0.8100558659217877

In [133]:
x_test.head()

     Pclass   Age      Fare  Gender_n
689       1  15.0  211.3375         0
777       3   5.0   12.4750         0
627       1  21.0   77.9583         0
135       2  23.0   15.0458         1
605       3  36.0   15.5500         1

In [134]:
model.predict([[3, 20, 15.7417, 1]])

array([1])